MusicApp/app/models/user.rb

    def reset_session_token!
        self.update!(session_token: generate_session_token)
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "ub-Y1UCO_RmNLxQCyjqlWg"], ["updated_at", "2020-12-08 19:52:06.902047"], ["id", 2]]